# https://stepik.org/lesson/709437/step/12?unit=710000
# Когда вам необходимо получить значение атрибута. Вы можете использовать метод .get_attribute('attribute'),
# Где attribute - это имя требуемого вам атрибута.
# <div class="content">
# 					<input type="checkbox" class="check" value="1">
# 					<input type="checkbox" class="check" value="2">
# 					<input type="checkbox" class="check" value="3">
# 			</div>
# Если необходимо получить значение value="" мы напишем следующий код.
from selenium import webdriver
from selenium.webdriver.common.by import By

# with webdriver.Chrome() as browser:
#     browser.get('http://parsinger.ru/selenium/5/5.html')
#     checkbox = browser.find_elements(By.CLASS_NAME, 'check')
#     for item in checkbox:
#         print(item.get_attribute('value'))
# >>>>>>1,2,3,4 ... 520
# ZADACHA
# Откройте сайт=http://parsinger.ru/selenium/5/5.html;
# Установите чек боксы в положение checked при помощи selenium и метода click();
# Должны быть установлены те чек боксы, значение value="" которых, есть в списке numbers;
# Когда все необходимые чек боксы станут checked , кнопка станет активной, нажмите на неё и скопируйте результат
# Результат появится в <p id="result">Result</p>;
# Вставьте число в поле для ответа.
# numbers = [1, 2, 3, 4, 8, 9, 11, 12, 13, 14, 15, 16, 17, 22, 23, 28, 29, 33, 34, 38,
# 39, 43, 44, 48, 49, 51, 52, 53, 54, 55, 56, 57, 58, 61, 62, 63, 64, 68, 69, 73,
# 74, 78, 79, 83, 84, 88, 89, 91, 92, 97, 98, 101, 104, 108, 109, 113, 114, 118,
# 119, 123, 124, 128, 129, 131, 132, 137, 138, 140, 141, 144, 145, 148, 149, 153,
# 154, 158, 159, 163, 164, 165, 168, 169, 171, 172, 177, 178, 180, 181, 184, 185,
# 187, 188, 189, 190, 192, 193, 194, 195, 197, 198, 199, 200, 204, 205, 206, 207,
# 208, 209, 211, 212, 217, 218, 220, 221, 224, 225, 227, 228, 229, 230, 232, 233,
# 234, 235, 237, 238, 239, 240, 245, 246, 247, 248, 249, 251, 252, 253, 254, 255,
# 256, 257, 258, 260, 261, 264, 265, 268, 269, 273, 274, 278, 279, 288, 289, 291,
# 292, 293, 294, 295, 296, 297, 300, 301, 302, 303, 304, 305, 308, 309, 313, 314,
# 318, 319, 328, 329, 331, 332, 339, 340, 341, 342, 343, 344, 345, 346, 348, 349,
# 353, 354, 358, 359, 368, 369, 371, 372, 379, 380, 385, 386, 408, 409, 411, 412,
# 419, 420, 425, 426, 428, 429, 433, 434, 438, 439, 444, 445, 446, 447, 448, 451,
# 452, 459, 460, 465, 466, 467, 468, 469, 470, 472, 473, 474, 475, 477, 478, 479,
# 480, 485, 486, 487, 488, 491, 492, 499, 500, 505, 506, 508, 509, 513, 514, 518, 519]

# Павел Хошев в прошлом году

import time
from selenium.webdriver.chrome.options import Options
from selenium import webdriver
from selenium.webdriver.common.by import By

number = [1, 2, 3, 4, 8, 9, 11, 12, 13, 14, 15, 16, 17, 22, 23, 28, 29, 33, 34, 38,
          39, 43, 44, 48, 49, 51, 52, 53, 54, 55, 56, 57, 58, 61, 62, 63, 64, 68, 69, 73,
          74, 78, 79, 83, 84, 88, 89, 91, 92, 97, 98, 101, 104, 108, 109, 113, 114, 118,
          119, 123, 124, 128, 129, 131, 132, 137, 138, 140, 141, 144, 145, 148, 149, 153,
          154, 158, 159, 163, 164, 165, 168, 169, 171, 172, 177, 178, 180, 181, 184, 185,
          187, 188, 189, 190, 192, 193, 194, 195, 197, 198, 199, 200, 204, 205, 206, 207,
          208, 209, 211, 212, 217, 218, 220, 221, 224, 225, 227, 228, 229, 230, 232, 233,
          234, 235, 237, 238, 239, 240, 245, 246, 247, 248, 249, 251, 252, 253, 254, 255,
          256, 257, 258, 260, 261, 264, 265, 268, 269, 273, 274, 278, 279, 288, 289, 291,
          292, 293, 294, 295, 296, 297, 300, 301, 302, 303, 304, 305, 308, 309, 313, 314,
          318, 319, 328, 329, 331, 332, 339, 340, 341, 342, 343, 344, 345, 346, 348, 349,
          353, 354, 358, 359, 368, 369, 371, 372, 379, 380, 385, 386, 408, 409, 411, 412,
          419, 420, 425, 426, 428, 429, 433, 434, 438, 439, 444, 445, 446, 447, 448, 451,
          452, 459, 460, 465, 466, 467, 468, 469, 470, 472, 473, 474, 475, 477, 478, 479,
          480, 485, 486, 487, 488, 491, 492, 499, 500, 505, 506, 508, 509, 513, 514, 518, 519]

with webdriver.Chrome() as browser:
    browser.get('http://parsinger.ru/selenium/5/5.html')
    [x.click() for n, x in enumerate(browser.find_elements(By.CLASS_NAME, 'check'), start=1) for y in number if y == n]
    # сам ДОБАВИЛ:
    browser.find_element(By.CLASS_NAME, 'btn').click()
    print(browser.find_element(By.ID, 'result').text)
    time.sleep(5)

# >>>932169874631968746874987464354
